Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: To go the other way (produce a number in octal), use sprintf() or printf():
es_es: Para hacer lo contrario (producir un número en octal), use sprintf() o printf():

source: Storing a reference to a constant value in a symbol table is equivalent to a full typeglob referencing a constant subroutine, but using about 400 bytes less memory.
es_es: Almacenar una referencia a un valor constante en una tabla de símbolos es equivalente a un completo typeglob referenciando a una subrutina constante, pero usando unos 400 bytes menos de memoria.

source: =head2 Smart match changes
es_es: =head2 Cambios en la coincidencia inteligente

source: Then it will try to match C<(?!123)> with "123", which fails.
es_es: Entonces tratará de hacer coincidir C<(?!123)> con "123", por lo que falla.

source: The recommended order of sections in Perl module documentation is:
es_es: El orden recomendado de las secciones de documentación de un módulo Perl es:

source: use C<FE<lt>E<gt>> or C<CE<lt>E<gt>> for file names.
es_es: use C<FE<lt>E<gt>> o C<CE<lt>E<gt>> para nombres de archivos.

source: Use of the supplied camel for anything other than a perl executable's icon is specifically not covered, and anyone wishing to redistribute perl binaries I<with> the icon should check directly with O'Reilly beforehand.
es_es: El uso del camello suministrado, para cualquier otra cosa que fuera más allá de ser el icono de un archivo ejecutable perl no está específicamente cubierto, y cualquiera que quiera redistribuir binarios perl I<con> el icono debe consultar antes, y directamente, con O'Reilly.

source: {} anon.
es_es: {} ref. hash

source: See the documentation for C<ExtUtils::MakeMaker> or C<Module::Build> for more on how to specify C<configure_requires> when creating a distribution for CPAN.
es_es: Consulte la documentación de C<ExtUtils::MakeMaker> o C<Module::Build> para más información sobre cómo especificar C<configure_requires> cuando se crea una distribución para CPAN.

source: display_day();
es_es: muestra_día();

source: Specifying VERSION as a literal of the form v5.6.1 should generally be avoided, because it leads to misleading error messages under earlier versions of Perl that do not support this syntax.
es_es: Especificando VERSIÓN como un literal de la forma v5.6.1, debe, generalmente, evitarse, porque lleva crear mensajes de error equívocos en las versiones anteriores de Perl que no admiten esta sintaxis.

source: The current value of C<$,> (if any) is printed between each LIST item.
es_es: El valor actual de C<$,> (si lo tiene) es impreso entre cada elemento de la LISTA.

source: {n,m} Match at least n but not more than m times
es_es: {n,m} Coincide al menos n veces, pero no más de m veces

source: (?{ $res = $cnt }) # On success copy to # non-localized location.
es_es: (?{ $res = $cnt }) # En éxito, copiar a una variable no-localizada

source: # Wrong, will now warn
es_es: # Incorrecto, mostrará un aviso

source: See the F<Changes> file in the distribution for details.
es_es: Ver el archivo F<Changes> en la distribución para más detalles.

source: say '$foo is undefined';
es_es: say '$foo es indefinido';

source: Add space after the C<s> when using a character allowed in identifiers.
es_es: Añadir un espacio después de la C<s> cuando se utilice un carácter permitido en identificadores.

source: Recursing deeper than 50 times without consuming any input string will also result in a fatal error.
es_es: Realizar un proceso recursivo más de 50 veces sin consumir ninguna cadena de entrada resultará en un error fatal.

source: This assumes that doubles must be aligned to the size of double.
es_es: Esto supone que los dobles deben estar alineados con el tamaño de un doble.

source: or die "Can't open '@_': $!";
es_es: or die "No puedo abrir '@_': $!";

source: How do I make it work?
es_es: ¿Cómo puedo hacer que funcione?

source: print $y; # prints nothing; $y has fallen out of scope
es_es: print $y; # no imprime nada; $y está fuera del ámbito

source: The character C<-> is treated specially and therefore C<\-> is treated as a literal C<->.
es_es: El carácter C<-> es tratado de forma especial y por lo tanto C<\-> es tratado como un literal C<->.

source: perlsub Perl subroutines
es_es: perlsub Subrutinas

source: =item "Package"
es_es: =item "Paquete"

source: Suppose that we want to enable a new RE escape-sequence C<\Y|> which matches at a boundary between whitespace characters and non-whitespace characters.
es_es: Supongamos que se desea habilitar una nueva secuencia de escape RE C<\Y|> que coincide en el límite entre los espacios en blanco y los caracteres no son blancos.

source: perl583delta Perl changes in version 5.8.3
es_es: perl583delta Cambios en la versión 5.8.3

source: Firstly, copy the source and build a native copy of perl for your host system.
es_es: En primer lugar, copiar el código fuente y crear una copia nativa de perl de su sistema principal.

source: Perl 5.8.1 does build and work well with Cygwin 1.3: with (uname -a) C<CYGWIN_NT-5.0 ... 1.3.22(0.78/3/2) 2003-03-18 09:20 i686 ...> a 100% "make test" was achieved with C<Configure -des -Duseithreads>.
es_es: Perl 5.8.1 se compila y funciona bien con Cygwin 1.3: con (uname-a) C<CYGWIN_NT-5.0 ... 1.3.22(0.78/3/2) 2003-03-18 09:20 i686 ...> se consiguió un 100% de un "make test" con C<Configure -des -Duseithreads>.

source: mkdir $tmpdir, 0700 or die "can't mkdir $tmpdir: $!";
es_es: mkdir $tmpdir, 0700 or die "no puedo hacer mkdir $tmpdir: $!";

source: This allows you to intermix your source code and your documentation text freely, as in
es_es: Esto le permite entremezclar código fuente y texto de la documentación libremente, como por ejemplo

source: (See L</"Smart matching in detail"> for more information on smart matching.) But when EXPR is one of the below exceptional cases, it is used directly as a boolean:
es_es: (Ver L</"Coincidencia inteligente en detalle"> para más información sobre coincidencia inteligente) Pero cuando EXPR es una de las excepciones abajo indicadas, se usa directamente como un booleano:

source: Operators such as C<++>, C<-->, C<+=>, C<-=>, and C<.=>, that operate on undefined left values such as:
es_es: Operadores como C<++>, C<-->, C<+=>, C<-=> y C<.=>, que operan sobre valores no definidos como en:

source: (If all fields are empty, they are considered to be trailing.)
es_es: (Si todos los campos están vacíos, se consideran que están al final).

source: although without duplicating any side effects that dereferencing the lvalue might trigger, such as from tie().
es_es: pero sin duplicar los efectos laterales que, desreferenciando el valor de la izquierda, se podrían desencadenar, como por ejemplo, de tie().

source: =head2 Miscellaneous
es_es: =head2 Varios

source: Certainly not.
es_es: Por supuesto que no.

source: perlfaq7 Perl Language Issues
es_es: perlfaq7 Problemas del lenguaje Perl

source: This means that at sites with lots of users and groups the functions no longer fail by returning only partial results.
es_es: Esto significa que en los sitios con una gran cantidad de usuarios y grupos, las funciones ya no fallarán devolviendo solo resultados parciales.

source: In general, they do what you want, unless you want consistency.
es_es: En general, ellos hacen lo que usted quiere, siempre que quiera coherencia.

source: This information is here to help you avoid the same mistakes and the extra work that would inevitably be required to fix them.
es_es: Esta información está aquí para ayudarle a evitar los mismos errores y el trabajo extra que, inevitablemente, tendría que invertir en arreglarlos.

source: Example: [[:upper:]] matches any uppercase character.
es_es: Ejemplo: [[:upper:]] coincide con cualquier carácter en mayúscula.

source: Empty trailing fields, on the other hand, are produced when there is a match at the end of the string (and when LIMIT is given and is not 0), regardless of the length of the match.
es_es: Campos vacíos consecuentes, por el contrario, se producen cuando hay una coincidencia al final de la cadena (y cuando LÍMITE se ha dado y no es 0), independientemente de la longitud de la coincidencia.

source: The rest of the name tells you the particular value to which it refers.
es_es: El resto del nombre indica a qué valor particular se accede.

source: In particular, characters C<"0"> and C<"1"> generate bits 0 and 1, as do characters C<"\000"> and C<"\001">.
es_es: En particular, los caracteres C<"0"> y C<"1"> generan los bits 0 y 1, al igual que los caracteres C<"\000"> y C<"\001">.

source: This script was primarily a technology demonstrator for Perl 5.8.0, but you can use piconv in the place of iconv for virtually any case.
es_es: Este script se desarrolló simplemente como una demostración de tecnología para Perl 5.8.0, pero puede usar piconv para cualquier tarea para la que usaría iconv.

source: See L<http://unicode.org/reports/tr36> for a detailed discussion of Unicode security issues.
es_es: Vea L<http://unicode.org/reports/tr36> para una discusión detallada de los problemas de seguridad en Unicode.

source: Why waste brainpower on a one-shot when you might want to do something like it again?
es_es: ¿Por qué perder la energía cerebral de un acierto cuando puede volver a usarlo otra vez?

source: %map = ( red => 0x00f, blue => 0x0f0, green => 0xf00,
es_es: %map = ( rojo => 0x00f, azul => 0x0f0, verde => 0xf00,

source: An environment variable is used, rather than parallel make itself, because L<TAP::Harness> needs to be able to schedule individual non-conflicting test scripts itself, and there is no standard interface to C<make> utilities to interact with their job schedulers.
es_es: Se utiliza una variable de entorno, en lugar de ejecutarse por sí mismo en paralelo, porque L<TAP::Harness> tiene que ser capaz, por sí mismo, de programar scripts de test individuales sin que haya conflictos entre ellos, y no hay un interfaz estándar de C<make> para interactuar con las programaciones de sus trabajos.

source: @info = stat($file) or die; # better, now @info gets its due
es_es: @info = stat($archivo) or die; # mejor, ahora @info obtiene el valor correcto

source: =item Fetching network info X<network> X<protocol> X<host> X<hostname> X<IP> X<address> X<service>
es_es: =item Obteniendo información de la red X<network> X<protocol> X<host> X<hostname> X<IP> X<address> X<service> X<red> X<protocolo> X<servidor> X<dirección> X<servicio>

source: (C<croak()> is a better version of C<die()> for use within modules, which reports its errors from the perspective of the caller.
es_es: (C<croak()> es una versión mejorada de C<die()> para usar dentro de los módulos, que reporta sus errores desde la perspectiva del llamador.

source: Release notes or changelogs should be produced for each release of your software describing user-visible changes to your module, in terms relevant to the user.
es_es: Notas de versión o las listas de cambios deben producirse para cada versión de su software que describa los cambios visibles de su módulo, en términos relevantes para el usuario.

# printf "%2$d %d ", 12, 34; # will print "34 12 "
source: printf "%2\$d %d\n", 12, 34; # will print "34 12\n"
es_es: printf "%2\$d %d\n", 12, 34; # imprimirá "34 12\n"

source: =item BBEdit and BBEdit Lite
es_es: =item BBEdit y BBEdit Lite

source: 7 size 7 yearday 7 is_require $$ process ID
es_es: 7 size 7 día año 7 is_require $$ Id. proceso

source: It is generally easier to read C<$var_names_like_this> than C<$VarNamesLikeThis>, especially for non-native speakers of English.
es_es: Generalmente es más fácil leer C<$var_nombres_como_este> que C<$VarNombresComoEste>, especialmente para los que no sean castellanoparlantes.

source: In particular, it is not limited to using regular expressions.
es_es: En particular, no está limitado a usar expresiones regulares.

source: Redeclaration of "sendfile" with a different storage class specifier:
es_es: Redeclaración de "sendfile" con un especificador de clase de almacenamiento diferente:

source: =item crypt PLAINTEXT,SALT X<crypt> X<digest> X<hash> X<salt> X<plaintext> X<password> X<decrypt> X<cryptography> X<passwd> X<encrypt>
es_es: =item crypt TEXTOPLANO,SALTO X<crypt> X<digest> X<hash> X<salt> X<plaintext> X<password> X<decrypt> X<cryptography> X<passwd> X<contraseña>

source: Finally, for backward (and we do mean "backward") compatibility, Perl permits these unnecessary but widely-supported conversions:
es_es: Por último, para compatibilidad anterior (y nos referimos a "hacia atrás"), Perl permite estas innecesarias, pero ampliamente soportadas conversiones:

source: \U uppercase all characters till \E seen
es_es: \U mayúsculas hasta encontrar \E

source: C<q#foo#> is parsed as the string C<foo>, while C<q #foo#> is the operator C<q> followed by a comment.
es_es: C<q#foo#> es analizado como la cadena C<foo>, mientras que C<q #foo#> es el operador C<q> seguido por un comentario.

source: To use FILEHANDLE alone to print the content of C<$_> to it, you must use a real filehandle like C<FH>, not an indirect one like C<$fh>.
es_es: Para utilizar solamente IDENTIFICADOR_ARCHIVO para imprimir en él, el contenido de C<$_>, debe ser un identificador de archivo real, como C<FH>, no uno indirecto como C<$fh>.

source: # "\001\000\002\000" on little-endian
es_es: # "\001\000\002\000" en little-endian

source: See also L<Quote and Quote-like Operators> toward the end of this section, as well as L</"I/O Operators">.
es_es: Vea también L<Comillas y Operadores de comillas> hacia el final de esta sección, así como L</"Operadores E/S">.

source: If the string happens to be encoded as UTF-8 internally (and thus has the UTF8 flag set), this is ignored by C<vec>, and it operates on the internal byte string, not the conceptual character string, even if you only have characters with values less than 256.
es_es: Si la cadena pasa a ser codificado como UTF-8 de forma interna (y por tanto tiene la bandera UTF8 establecida), esto se ignora por C<vec>, y opera en la cadena de bytes interna, no la cadena de caracteres conceptuales, incluso si sólo tiene caracteres con valores inferiores a 256.

source: should be enough, the Configure should automatically probe for the correct 64-bit settings.
es_es: debería ser suficiente, la opción Configure automáticamente debería buscar la configuración correcta para 64 bit.

source: The length limit on values (not keys) in the %ENV hash has been raised from 255 bytes to 32640 bytes (except when the PERL_ENV_TABLES setting overrides the default use of logical names for %ENV).
es_es: El límite de longitud en los valores (no claves) en el hash %ENV se ha elevado de 255 bytes a 32640 bytes (excepto cuando el ajuste PERL_ENV_TABLES sobreescribe el uso predeterminado de los nombres lógicos de %ENV).

source: Copying a file onto itself used to fail.
es_es: Copiando un archivo sobre sí mismo provocará un error.

source: The return value of the ioctl() built-in function was accidentally broken in 5.8.0.
es_es: El valor de retorno de la función incorporada ioctl() se rompió accidentalmente en 5.8.0.

source: unpack("Z*Z*", pack("Z*Z*", ..)) was broken
es_es: unpack("Z*Z*", pack("Z*Z*", ..)) estaba roto

source: =item Functions for real %HASHes X<hash>
es_es: =item Funciones %HASH reales X<hash>

source: In the RE above, which is intentionally obfuscated for illustration, the delimiter is C<m>, the modifier is C<mx>, and after delimiter-removal the RE is the same as for C<m/ ^ a \s* b /mx>.
es_es: En la RE anterior, que está intencionalmente ofuscada para su ilustración, el delimitador es C<m>, el modificador es C<mx>, y después de la eliminación de los delimitadores, la RE es la misma que C<m/ ^ a \s* b /mx>.

# printf "child died with signal %d, %s coredump ", ($?
source: printf "child died with signal %d, %s coredump\n", ($?
es_es: printf "hijo muerto con señal %d, %s coredump\n", ($?

source: Named captures are implemented as being aliases to numbered groups holding the captures, and that interferes with the implementation of the branch reset pattern.
es_es: Las capturas nominadas son implementadas como alias a los grupos numerados que almacenan las capturas, y esto interfiere con la implementación del patrón de reinicio de rama.

source: translates a list of numbers to the corresponding characters.
es_es: traduce una lista de números a sus caracteres correspondientes.

source: Described in L<POSIX>.
es_es: Se describe en L<POSIX>.

source: C<upload_hook()> and C<append()> now works in function-oriented mode
es_es: C<upload_hook()> y C<append()> ahora funcionan en el modo orientado a función

source: The position in the file of FILEHANDLE is left unchanged.
es_es: La posición en el archivo de IDENTIFICADOR_ARCHIVO no cambia.

source: The numbers underneath show in which group the captured content will be stored.
es_es: Los números de abajo muestran en qué grupo de captura será almacenado.

source: Note that just as in C, Perl doesn't define B<when> the variable is incremented or decremented.
es_es: Tenga en cuenta que, al igual que en C, Perl no define B<cuando> la variable se incrementa o disminuye.

source: L<perlapi>, L<perlintern>, L<perlmodlib> and L<perltoc> are now all generated at build time, rather than being shipped as part of the release.
es_es: L<perlapi>, L<perlintern>, L<perlmodlib> y L<perltoc> son ahora generados en tiempo de compilación, en lugar de ser empaquetados como parte de la distribución.

source: =item Keywords related to classes and object-orientation X<object> X<class> X<package>
es_es: =item Palabras clave relativas a las clases y orientación a objetos X<object> X<class> X<package> X<objeto> X<clase> X<paquete>

source: my $x; our $x; # warns
es_es: my $x; our $x; # avisa

source: s/foo/bar/el; # "e" and "l" flags
es_es: s/foo/bar/el; # opciones "e" y "l"

source: If C<$b> is negative, then C<$a % $b> is C<$a> minus the smallest multiple of C<$b> that is not less than C<$a> (i.e. the result will be less than or equal to zero).
es_es: Si C<$b> es negativo, entonces C<$a % $b> es C<$a> menos el múltiplo más pequeño de C<$b> que no es menor que C<$a> (es decir el resultado será menor o igual a cero).

source: The handling of complex expressions by the C<given>/C<when> switch statement has been enhanced.
es_es: El manejo de expresiones complejas por C<given>/C<when> de la instrucción switch ha sido mejorado.

source: If there are no more entries, returns the undefined value in scalar context and the empty list in list context.
es_es: Si no hay más entradas, devuelve el valor indefinido en el contexto escalar y la lista vacía en el contexto de lista.

source: =head2 Effect of pragmas in eval
es_es: =head2 Efecto de los pragma en eval

source: For example, this produces nine strings, one for each pairing of fruits and colors:
es_es: Por ejemplo, esto produce nueve cadenas, una por cada par de frutas y colores:

source: This flag tells Perl to interpret the supplied string as a vector of integers, one for each character in the string.
es_es: Esta bandera le dice a Perl que interprete la cadena indicada como un vector de enteros, uno para cada carácter en la cadena.

source: You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:
es_es: Usted puede distribuir los programas de este Paquete en código objeto o en formato ejecutable, siempre que usted haga por lo menos UNO de los puntos siguientes:

source: Detached threads are now also supported on Windows.
es_es: I<Threads> desligados son ahora también compatibles con Windows.

source: C<next> cannot be used to exit a block which returns a value such as C<eval {}>, C<sub {}>, or C<do {}>, and should not be used to exit a grep() or map() operation.
es_es: C<next> no se puede utilizar para salir de un bloque que devuelve un valor, como en C<eval {}>, C<sub {}> o C<do {}>, y no debe ser utilizado para salir de una operación grep() o map().

source: And if you used C<*>'s in the internal groups instead of limiting them to 0 through 5 matches, then it would take forever--or until you ran out of stack space.
es_es: Y si ha utilizado algún C<*> en los grupos internos en lugar de limitarlos a 0 a 5 coincidencias, entonces se ejecutará para siempre o hasta que se quede sin espacio de pila.

source: An integer OPTVAL is shorthand for pack("i", OPTVAL).
es_es: Un entero como OPCIÓN_VALOR es la abreviatura de pack("i", OPCIÓN_VALOR).

source: perl5004delta - what's new for perl5.004
es_es: perl5004delta - qué hay de nuevo para perl5.004

source: A Perl script or program consists of one or more statements.
es_es: Un script o programa Perl consta de una o varias instrucciones.

source: You can find out whether your Perl supports long doubles via L<Config>:
es_es: Puede averiguar si su Perl soporta dobles a través de L<Config>:

source: perlreref has been added: it is a regular expressions quick reference.
es_es: perlreref ha sido añadido: es una referencia rápida para expresiones regulares.

source: =head2 Backtracking X<backtrack> X<backtracking>
es_es: =head2 I<Backtracking> (Vuelta atrás) X<backtrack> X<backtracking> X<vuelta atrás>

source: =head1 NOTE
es_es: =head1 NOTA

source: Binary "gt" returns true if the left argument is stringwise greater than the right argument.
es_es: Binario "gt" devuelve verdadero si el argumento de la izquierda es alfanuméricamente mayor que el argumento de la derecha.

source: Ordering of two matches for C<S> is the same as for C<S>.
es_es: Ordenación de dos coincidencias para C<S> es lo mismo que para C<S>.

source: ISBN 1-59059-097-X [1st edition July 2003]
es_es: ISBN 1-59059-097-X [1ª edición - Julio de 2003]

source: In general, the benefit of a language is closely related to the skill of the people using that language.
es_es: En general, las ventajas que ofrece un lenguaje están muy relacionadas con la destreza de los usuarios del lenguaje.

source: If you try that on an undefined variable, you'll take an exception.
es_es: Si intenta hacer esto en una variable no definida, recibirá una excepción.

source: If LIMIT is unspecified or zero, trailing null fields are stripped (which potential users of C<pop> would do well to remember).
es_es: Si LÍMITE no está especificado o es cero, los campos vacíos finales son descartados (que los potenciales usuarios de C<pop> harían bien en recordar).

source: my $f = myopen("</etc/motd");
es_es: my $f = miopen("</etc/motd");

source: You can also explicitly specify the argument number to use for the join string using something like C<*2$v>; for example:
es_es: También puede especificar, explícitamente, el número de argumento a utilizar para la combinación de cadena usando algo como C<*2$v>; por ejemplo:

source: It's still in development in both its syntax and design.
es_es: Su sintaxis y su diseño aún están en fase de desarrollo.

source: For example, even under C<use integer>, if you take the C<sqrt(2)>, you'll still get C<1.4142135623731> or so.
es_es: Por ejemplo, incluso bajo C<use integer>, si escribe C<sqrt(2)>, seguirá obteniendo, más o menos, C<1.4142135623731>.

source: =item gethostbyaddr ADDR,ADDRTYPE
es_es: =item gethostbyaddr DIRECCIÓN,TIPODIR

source: This function binds a variable to a package class that will provide the implementation for the variable.
es_es: Esta función une una variable a una clase de paquete que ofrecerá la implementación para esa variable.

source: or die "Can't open netscape history file: $!";
es_es: or die "No puedo abrir el archivo histórico del netscape: $!";

source: See L<perllocale> and L<POSIX>.
es_es: Ver L<perllocale> y L<POSIX>.

source: -x File is executable by effective uid/gid.
es_es: -x Archivo es ejecutable por el uid/gid en vigor.

source: the output produced should be the following:
es_es: la salida producida debe ser la siguiente:
